#### List를 이용한 DataFrame 생성

##### panadas dataframe(index, columns)
dic (key, values)
series(index, ???)

In [ ]:
import pandas as pd # 행과 열이 있어서 기본적으로 2차원

In [5]:
df = pd.DataFrame(
    [
        [  15, '남', '덕영중'   ],
        [  17, '여', '수리중'   ],
    ],
    index = ['준서', '예은'],
    columns=['나이', '성별', '학교']
)
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [11]:
df.index = ['학생1', '학생2']
df.columns = ['연령', '남녀', '소속']
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [15]:
# 열 이름중 연령 -> 나이
df.rename(
    columns={
        '연령':'나이'
    },
    inplace=True # 즉시 적용 ( 메모리에 )    
)
df

     나이 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [18]:
# 열 이름중 남녀 -> 성별, 소속 -> 학교로 변경하기
df.rename(
    columns = {
        '남녀':'성별',
        '소속':'학교'
    },
    inplace=True
)
df

     나이 성별   학교
학생1  15  남  덕영중
학생2  17  여  수리중

In [19]:
# 행 이름을 변경하기 학생1 -> 준서, 학생2 -> 예은
df.rename(
    index={
        '학생1':'준서',
        '학생2':'예은'
    },
    inplace=True
)
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

---
#### 행 삭제

In [28]:
df = pd.DataFrame(
    [
        [90, 98, 85, 100],
        [80, 89, 95, 90],
        [70, 95, 100, 90],
    ],
    index=['서준', '우현', '인아'],
    columns = ['수학', '영어', '음악', '체육']
    
)
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [47]:
# dictionary
df = pd.DataFrame(
            {
            '수학' : [90,80,70],
            '영어' :[98,89,95],
            '음악' : [85,95,100],
            '체육' :[100,90,90]
        },
    index = ['서준', '우현', '인아']    
)
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [48]:
# 데이터 프레임 복사
df2 = df.copy()

In [50]:
# df2의 index가 우현인 행을 삭제
df2.drop(
    index='우현'
)

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [53]:
df2.drop(
    '우현',
    axis='rows',  # rows 를 0으로 적을 수 있음.
    inplace=True
)
df2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [59]:
# 우현, 인아 행 한꺼번에 지우기

df3.drop(
    index = ['우현', '인아']
)

    수학  영어  음악   체육
서준  90  98  85  100

In [ ]:
df3.drop(
    ['우현', '인아'],
    axis= 'rows',
)

---
### 열 삭제

In [67]:
df4 = df.copy()

In [64]:
# df4의 수학열 삭제
df4.drop(
    columns = '수학'
)

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [68]:
df4.drop(
    '수학',
    axis='columns',
    inplace=True
)
df4

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [69]:
df5 = df.copy()

In [70]:
# df5의 영어, 음악 삭제
df5.drop(
    columns = ['영어', '음악']
)

    수학   체육
서준  90  100
우현  80   90
인아  70   90

In [72]:
df5.drop(
    ['영어', '음악'],
    axis='columns',
    inplace=True
)
df5

    수학   체육
서준  90  100
우현  80   90
인아  70   90

---
#### 행 선택
- index 이름을 기준으로 선택할 경우에는 loc
- 정수형 위치 index를 선택할 경우에는 iloc

In [ ]:
# index가 서준인 행을 선택
print(df.loc['서준',:])
print(df.iloc[0,:]) # (index, )

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64
수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [ ]:
# loc와 iloc로 행이 서준, 우현인 데이터 추출하기

print(df.loc[['서준', '우현'], :])
print(df.iloc[0:1+1,:])

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

---
#### 열 선택

In [195]:
# dictionary
df = pd.DataFrame(
        {
            '이름':['서준', '우현', '인아'],
            '수학' : [90,80,70],
            '영어' :[98,89,95],
            '음악' : [85,95,100],
            '체육' :[100,90,90]
        },

)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [92]:
df['수학']
df.수학
df.loc[:,'수학']
df.iloc[:, 1]

0    90
1    80
2    70
Name: 수학, dtype: int64

In [104]:
df[['음악', '체육']]
df.loc[:,['음악', '체육']]
df.iloc[:, [3,4]]


# df['음악': '체육']
df.loc[:,'음악': '체육']
df.iloc[:, 3:4+1]

    음악   체육
0   85  100
1   95   90
2  100   90

In [ ]:
df.iloc[::2] # [start : stop : step]

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
2  인아  70  95  100   90

In [ ]:
df.iloc[::-1]

   이름  수학  영어   음악   체육
2  인아  70  95  100   90
1  우현  80  89   95   90
0  서준  90  98   85  100

---
#### 인덱스 설정하기

In [131]:
df # flie은 index를 몰라서 불러오면 이런식으로 나옴 인덱스 순서는 맞고~

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [130]:
# 이름 열을 index로 설정하자
df.set_index('이름', inplace=True)
df

KeyError: "None of ['이름'] are in the columns"

In [124]:
df.reset_index(inplace=True)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [126]:
df['수학']

이름
서준    90
우현    80
인아    70
Name: 수학, dtype: int64

In [ ]:
# 서준의 음악과 체육점수를 추출하자
# 1) loc와 indexing
# 2) iloc와 indexing
# 3) loc와 slicing
# 4) iloc와 slicing

df.loc['서준',['음악','체육']]  # index => 지명, 
df.iloc[0,[2, 3]]
df.loc['서준','음악':'체육']
df.iloc[0, 2:3+1]

음악     85
체육    100
Name: 서준, dtype: int64

---
#### 열 추가

In [ ]:
# 국어 컬럼 생성 및 점수 부여하기

'국어' in df.columns  # 찾는 이름이 있는지
df['국어'] =80
df

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  80
1  우현  80  89   95   90  80
2  인아  70  95  100   90  80

In [ ]:
# 생물 컬럼 추가 및 서준 : 50, 우현: 60, 인아 : 70
df['생물'] = [50, 60, 70]
df

   이름  수학  영어   음악   체육  국어  생물
0  서준  90  98   85  100  80  50
1  우현  80  89   95   90  80  60
2  인아  70  95  100   90  80  70

#### 행으로 데이터 추가

In [200]:
df

   이름  수학  영어   음악   체육  국어  생물
0  서준  90  98   85  100  80  50
1  우현  80  89   95   90  80  60
2  인아  70  95  100   90  80  70

In [206]:
df.loc[3] = 0
df

   이름  수학  영어   음악   체육  국어  생물
0  서준  90  98   85  100  80  50
1  우현  80  89   95   90  80  60
2  인아  70  95  100   90  80  70
3   0   0   0    0    0   0   0

In [208]:
# 동규 , 90, 80, 70, 60, 50, 40
df.loc[4] = ['동규', 90, 80, 70, 60, 50, 40]
df

   이름  수학  영어   음악   체육  국어  생물
0  서준  90  98   85  100  80  50
1  우현  80  89   95   90  80  60
2  인아  70  95  100   90  80  70
3   0   0   0    0    0   0   0
4  동규  90  80   70   60  50  40

In [211]:
df.loc[6] = df.loc[2,:]
df

   이름  수학  영어   음악   체육  국어  생물
0  서준  90  98   85  100  80  50
1  우현  80  89   95   90  80  60
2  인아  70  95  100   90  80  70
3   0   0   0    0    0   0   0
4  동규  90  80   70   60  50  40
6  인아  70  95  100   90  80  70

In [227]:
df.set_index('이름', inplace=True)
df

    수학  영어   음악   체육  국어  생물
이름
서준  90  98   85  100  80  50
우현  80  89   95   90  80  60
인아  70  95  100   90  80  70
동규  90  80   70   60  50  40
인아  70  95  100   90  80  70

In [ ]:
# 서준의 체육점수를 80점으로 수정하기
df.loc['서준', '체육'] = 80
df

    수학  영어   음악  체육  국어  생물
이름
서준  90  98   85  80  80  50
우현  80  89   95  90  80  60
인아  70  95  100  90  80  70
동규  90  80   70  60  50  40
인아  70  95  100  90  80  70

In [232]:
# 서준의 음악과 체육점수를 50점으로 변경
df.loc['서준', ['음악', '체육']] = 80
df

    수학  영어   음악  체육  국어  생물
이름
서준  90  98   80  80  80  50
우현  80  89   95  90  80  60
인아  70  95  100  90  80  70
동규  90  80   70  60  50  40
인아  70  95  100  90  80  70

In [234]:
# 서준의 음악 점수는 100점과 체육점수를 70점으로 변경
df.loc['서준', ['음악', '체육']] = [100,70]
df

    수학  영어   음악  체육  국어  생물
이름
서준  90  98  100  70  80  50
우현  80  89   95  90  80  60
인아  70  95  100  90  80  70
동규  90  80   70  60  50  40
인아  70  95  100  90  80  70

---
### DataFrame 연산

In [236]:
#!pip install seaborn

In [237]:
import seaborn as sns

In [241]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [242]:
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [243]:
titanic.shape

(891, 15)

In [247]:
# titanic dataset에서 age와 fare 추출하여 dataframe 만들기

df = titanic.loc[:,['age', 'fare']]
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [250]:
addition = df + 10
addition.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [251]:
subtraction = df - 10
subtraction.head()

    age     fare
0  12.0  -2.7500
1  28.0  61.2833
2  16.0  -2.0750
3  25.0  43.1000
4  25.0  -1.9500

In [ ]:
titanic.info()
#

<class 'pandas.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    str
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    str
 8   class        891 non-null    category
 9   who          891 non-null    str
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    str
 13  alive        891 non-null    str
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), str(5)
memory usage: 80.7 KB